In [1]:
import pandas as pd
import numpy as np

In [2]:
import mysql.connector

config = {
    'host':'127.0.0.1',
    'user':'root',
    'passwd':'BeRisk912',
    'database':'sales'
}

connection = mysql.connector.connect(**config)
cursor = connection.cursor(buffered=True)

In [8]:
# # Run the sql file
# # we did it manually using MySQL workbench

# with open('db_dump.sql', 'r') as f:
#     with connection.cursor() as cursor:
#         cursor.execute(f.read(), multi=True)
#     connection.commit()

In [10]:
# show databases
# with pandas

command1 = '''
    SHOW DATABASES;
'''

show_databases = pd.read_sql(command1, connection)
show_databases

             Database
0               dqlab
1  information_schema
2               mysql
3  performance_schema
4   portofolioproject
5      record_company
6               sales
7   sales_codebasics1
8                 sys
9               world

In [11]:
# show databases
# without pandas

# cursor.execute("SHOW DATABASES;")

In [9]:
# Show Tables
command2 = '''
    SHOW TABLES;
'''

show_tables = pd.read_sql(command2, connection)
show_tables

  Tables_in_sales
0       customers
1            date
2         markets
3        products
4    transactions

# Functions

In [3]:
# Function for select

def select(command):
    return pd.read_sql(command, connection)

In [4]:
# Function for delete

def delete(command):
    cursor.execute(command)
    return 'successfully deleted'

In [5]:
# Function for update

def update(command):
    cursor.execute(command)
    return 'successfully updated'

In [6]:
# Function for look more into each column in the table

def unique_in_value_table(table):
    for i in table.columns:
        print(i, ': ', table[i].unique(), '\n')

## Customers Table

In [7]:
# customers table
command3 = '''
    SELECT * FROM sales.customers;
'''

# customers_select = pd.read_sql(command3, connection)
# customers_select.head()

customers = select(command3)
customers.head()

  customer_code    custmer_name   customer_type
0        Cus001    Surge Stores  Brick & Mortar
1        Cus002    Nomad Stores  Brick & Mortar
2        Cus003    Excel Stores  Brick & Mortar
3        Cus004  Surface Stores  Brick & Mortar
4        Cus005  Premium Stores  Brick & Mortar

In [8]:
unique_in_value_table(customers)

customer_code :  ['Cus001' 'Cus002' 'Cus003' 'Cus004' 'Cus005' 'Cus006' 'Cus007' 'Cus008'
 'Cus009' 'Cus010' 'Cus011' 'Cus012' 'Cus013' 'Cus014' 'Cus015' 'Cus016'
 'Cus017' 'Cus018' 'Cus019' 'Cus020' 'Cus021' 'Cus022' 'Cus023' 'Cus024'
 'Cus025' 'Cus026' 'Cus027' 'Cus028' 'Cus029' 'Cus030' 'Cus031' 'Cus032'
 'Cus033' 'Cus034' 'Cus035' 'Cus036' 'Cus037' 'Cus038']

custmer_name :  ['Surge Stores' 'Nomad Stores' 'Excel Stores' 'Surface Stores'
 'Premium Stores' 'Electricalsara Stores' 'Info Stores' 'Acclaimed Stores'
 'Electricalsquipo Stores' 'Atlas Stores' 'Flawless Stores'
 'Integration Stores' 'Unity Stores' 'Forward Stores'
 'Electricalsbea Stores' 'Logic Stores' 'Epic Stores'
 'Electricalslance Stores' 'Electricalsopedia Stores' 'Nixon' 'Modular'
 'Electricalslytical' 'Sound' 'Power' 'Path' 'Insight' 'Control' 'Sage'
 'Electricalsocity' 'Synthetic' 'Zone' 'Elite' 'All-Out' 'Expression'
 'Relief' 'Novus' 'Propel' 'Leader']

customer_type :  ['Brick & Mortar' 'E-Commerce']

In [9]:
# Export data to csv
customers.to_csv(r'csv_file/customers_clean.csv', 
                index = False, 
                header=True)

## Transactions Table

In [36]:
# Transactions Table
command4 = '''
    SELECT * FROM sales.transactions;
'''

transactions = select(command4)
transactions.head()

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency
0,Prod001,Cus001,Mark001,2017-10-10,100,41241.0,INR
1,Prod001,Cus002,Mark002,2018-05-08,3,-1.0,INR
2,Prod002,Cus003,Mark003,2018-04-06,1,875.0,INR
3,Prod002,Cus003,Mark003,2018-04-11,1,583.0,INR
4,Prod002,Cus004,Mark003,2018-06-18,6,7176.0,INR

In [10]:
# unique_in_value_table(transactions)

If we look at the currency, there is USD, because we only focus in India and year 2020, so we can ignore it.

In [39]:
# Look how many transactions using USD
command42 = '''
    SELECT * FROM sales.transactions
    WHERE 
        currency = 'USD'
        OR
        currency = 'USD\r';
'''

select(command42)

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency
0,Prod003,Cus005,Mark004,2017-11-20,59,500.0,USD
1,Prod003,Cus005,Mark004,2017-11-22,36,250.0,USD
2,Prod003,Cus005,Mark004,2017-11-20,59,500.0,USD\r
3,Prod003,Cus005,Mark004,2017-11-22,36,250.0,USD\r

In [59]:
# Update currency from 

command43 = '''
    UPDATE sales.transactions 
    SET 
        currency = 'INR'
    WHERE
        currency = 'INR\r';
'''

update(command43)

'successfully updated'

In [60]:
# clean transaction table
command44 = '''
    SELECT * FROM sales.transactions;
'''

transactions_clean = select(command44)
transactions_clean.head()

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency
0,Prod001,Cus001,Mark001,2017-10-10,100,41241.0,INR
1,Prod001,Cus002,Mark002,2018-05-08,3,-1.0,INR
2,Prod002,Cus003,Mark003,2018-04-06,1,875.0,INR
3,Prod002,Cus003,Mark003,2018-04-11,1,583.0,INR
4,Prod002,Cus004,Mark003,2018-06-18,6,7176.0,INR

In [61]:
transactions_clean.currency.unique()

array(['INR', 'USD', 'USD\r'], dtype=object)

In [62]:
# Export data to csv
transactions_clean.to_csv(r'csv_file/transactions_clean.csv', 
                index = False, 
                header=True)

## Markets Table

In [12]:
# markets table
command5 = '''
    SELECT * FROM sales.markets;
'''

markets = select(command5)
markets.head()

  markets_code markets_name     zone
0      Mark001      Chennai    South
1      Mark002       Mumbai  Central
2      Mark003    Ahmedabad    North
3      Mark004    Delhi NCR    North
4      Mark005       Kanpur    North

In [22]:
unique_in_value_table(markets)

markets_code :  ['Mark001' 'Mark002' 'Mark003' 'Mark004' 'Mark005' 'Mark006' 'Mark007'
 'Mark008' 'Mark009' 'Mark010' 'Mark011' 'Mark012' 'Mark013' 'Mark014'
 'Mark015' 'Mark097' 'Mark999']

markets_name :  ['Chennai' 'Mumbai' 'Ahmedabad' 'Delhi NCR' 'Kanpur' 'Bengaluru' 'Bhopal'
 'Lucknow' 'Patna' 'Kochi' 'Nagpur' 'Surat' 'Hyderabad' 'Bhubaneshwar'
 'New York' 'Paris']

zone :  ['South' 'Central' 'North' '']

In [24]:
markets[markets['markets_code']=='Mark999']

   markets_code markets_name zone
16      Mark999        Paris

In [26]:
markets[markets['markets_code']=='Mark097']

   markets_code markets_name zone
15      Mark097     New York

Because this data is only focused on India area, it's the best way to delete the markets_name from Paris and New York. Consecutively this will also delete all Mark097 and Mark999 in every table that has that markets_code.

In [30]:
command_delete1 = '''
    DELETE FROM sales.markets
    WHERE 
        markets_code='Mark097'
        AND
        markets_code='Mark999';
'''

delete(command_delete1)

'successfully deleted'

In [33]:
markets_clean = select(command5)
markets_clean.head()

  markets_code markets_name     zone
0      Mark001      Chennai    South
1      Mark002       Mumbai  Central
2      Mark003    Ahmedabad    North
3      Mark004    Delhi NCR    North
4      Mark005       Kanpur    North

In [63]:
# Export data to csv
markets_clean.to_csv(r'csv_file/markets_clean.csv', 
                index = False, 
                header=True)

## Products Table

In [65]:
# products table
command6 = '''
    SELECT * FROM sales.products;
'''

products = select(command6)
products.head()

  product_code product_type
0      Prod001  Own Brand\r
1      Prod002  Own Brand\r
2      Prod003  Own Brand\r
3      Prod004  Own Brand\r
4      Prod005  Own Brand\r

In [66]:
unique_in_value_table(products)

product_code :  ['Prod001' 'Prod002' 'Prod003' 'Prod004' 'Prod005' 'Prod006' 'Prod007'
 'Prod008' 'Prod009' 'Prod010' 'Prod011' 'Prod012' 'Prod013' 'Prod014'
 'Prod015' 'Prod016' 'Prod017' 'Prod018' 'Prod019' 'Prod020' 'Prod021'
 'Prod022' 'Prod023' 'Prod024' 'Prod025' 'Prod026' 'Prod027' 'Prod028'
 'Prod029' 'Prod030' 'Prod031' 'Prod032' 'Prod033' 'Prod034' 'Prod035'
 'Prod036' 'Prod037' 'Prod038' 'Prod039' 'Prod040' 'Prod041' 'Prod042'
 'Prod043' 'Prod044' 'Prod045' 'Prod046' 'Prod047' 'Prod048' 'Prod049'
 'Prod050' 'Prod051' 'Prod052' 'Prod053' 'Prod054' 'Prod055' 'Prod056'
 'Prod057' 'Prod058' 'Prod059' 'Prod060' 'Prod061' 'Prod062' 'Prod063'
 'Prod064' 'Prod065' 'Prod066' 'Prod067' 'Prod068' 'Prod069' 'Prod070'
 'Prod071' 'Prod072' 'Prod073' 'Prod074' 'Prod075' 'Prod076' 'Prod077'
 'Prod078' 'Prod079' 'Prod080' 'Prod081' 'Prod082' 'Prod083' 'Prod084'
 'Prod085' 'Prod086' 'Prod087' 'Prod088' 'Prod089' 'Prod090' 'Prod091'
 'Prod092' 'Prod093' 'Prod094' 'Prod095' 'Prod096' 'Prod097' 'Prod098'
 'Prod099' 'Prod100' 'Prod101' 'Prod102' 'Prod103' 'Prod104' 'Prod105'
 'Prod106' 'Prod107' 'Prod108' 'Prod109' 'Prod110' 'Prod111' 'Prod112'
 'Prod113' 'Prod114' 'Prod115' 'Prod116' 'Prod117' 'Prod118' 'Prod119'
 'Prod120' 'Prod121' 'Prod122' 'Prod123' 'Prod124' 'Prod125' 'Prod126'
 'Prod127' 'Prod128' 'Prod129' 'Prod130' 'Prod131' 'Prod132' 'Prod133'
 'Prod134' 'Prod135' 'Prod136' 'Prod137' 'Prod138' 'Prod139' 'Prod140'
 'Prod141' 'Prod142' 'Prod143' 'Prod144' 'Prod145' 'Prod146' 'Prod147'
 'Prod148' 'Prod149' 'Prod150' 'Prod151' 'Prod152' 'Prod153' 'Prod154'
 'Prod155' 'Prod156' 'Prod157' 'Prod158' 'Prod159' 'Prod160' 'Prod161'
 'Prod162' 'Prod163' 'Prod164' 'Prod165' 'Prod166' 'Prod167' 'Prod168'
 'Prod169' 'Prod170' 'Prod171' 'Prod172' 'Prod173' 'Prod174' 'Prod175'
 'Prod176' 'Prod177' 'Prod178' 'Prod179' 'Prod180' 'Prod181' 'Prod182'
 'Prod183' 'Prod184' 'Prod185' 'Prod186' 'Prod187' 'Prod188' 'Prod189'
 'Prod190' 'Prod191' 'Prod192' 'Prod193' 'Prod194' 'Prod195' 'Prod196'
 'Prod197' 'Prod198' 'Prod199' 'Prod200' 'Prod201' 'Prod202' 'Prod203'
 'Prod204' 'Prod205' 'Prod206' 'Prod207' 'Prod208' 'Prod209' 'Prod210'
 'Prod211' 'Prod212' 'Prod213' 'Prod214' 'Prod215' 'Prod216' 'Prod217'
 'Prod218' 'Prod219' 'Prod220' 'Prod221' 'Prod222' 'Prod223' 'Prod224'
 'Prod225' 'Prod226' 'Prod227' 'Prod228' 'Prod229' 'Prod230' 'Prod231'
 'Prod232' 'Prod233' 'Prod234' 'Prod235' 'Prod236' 'Prod237' 'Prod238'
 'Prod239' 'Prod240' 'Prod241' 'Prod242' 'Prod243' 'Prod244' 'Prod245'
 'Prod246' 'Prod247' 'Prod248' 'Prod249' 'Prod250' 'Prod251' 'Prod252'
 'Prod253' 'Prod254' 'Prod255' 'Prod256' 'Prod257' 'Prod258' 'Prod259'
 'Prod260' 'Prod261' 'Prod262' 'Prod263' 'Prod264' 'Prod265' 'Prod266'
 'Prod267' 'Prod268' 'Prod269' 'Prod270' 'Prod271' 'Prod272' 'Prod273'
 'Prod274' 'Prod275' 'Prod276' 'Prod277' 'Prod278' 'Prod279']

product_type :  ['Own Brand\r' 'Distribution\r']

In [68]:
# Update product_type 

command62 = '''
    UPDATE sales.products
    SET 
        product_type = 'Own Brand'
    WHERE
        product_type = 'Own Brand\r';
'''

update(command62)

'successfully updated'

In [69]:
# Update product_type 

command63 = '''
    UPDATE sales.products
    SET 
        product_type = 'Distribution'
    WHERE
        product_type = 'Distribution\r';
'''

update(command63)

'successfully updated'

In [70]:
# products table
command64 = '''
    SELECT * FROM sales.products;
'''

products_clean = select(command64)
products_clean.head()

  product_code product_type
0      Prod001    Own Brand
1      Prod002    Own Brand
2      Prod003    Own Brand
3      Prod004    Own Brand
4      Prod005    Own Brand

In [71]:
# Export data to csv
products_clean.to_csv(r'csv_file/products_clean.csv', 
                index = False, 
                header=True)

## Date Table

In [73]:
# date table
command7 = '''
    SELECT * FROM sales.date;
'''

date = select(command7)
date.head()

         date     cy_date  year month_name date_yy_mmm
0  2017-06-01  2017-06-01  2017       June    17-Jun\r
1  2017-06-02  2017-06-01  2017       June    17-Jun\r
2  2017-06-03  2017-06-01  2017       June    17-Jun\r
3  2017-06-04  2017-06-01  2017       June    17-Jun\r
4  2017-06-05  2017-06-01  2017       June    17-Jun\r

In [74]:
unique_in_value_table(date)

date :  [datetime.date(2017, 6, 1) datetime.date(2017, 6, 2)
 datetime.date(2017, 6, 3) ... datetime.date(2020, 6, 28)
 datetime.date(2020, 6, 29) datetime.date(2020, 6, 30)]

cy_date :  [datetime.date(2017, 6, 1) datetime.date(2017, 7, 1)
 datetime.date(2017, 8, 1) datetime.date(2017, 9, 1)
 datetime.date(2017, 10, 1) datetime.date(2017, 11, 1)
 datetime.date(2017, 12, 1) datetime.date(2018, 1, 1)
 datetime.date(2018, 2, 1) datetime.date(2018, 3, 1)
 datetime.date(2018, 4, 1) datetime.date(2018, 5, 1)
 datetime.date(2018, 6, 1) datetime.date(2018, 7, 1)
 datetime.date(2018, 8, 1) datetime.date(2018, 9, 1)
 datetime.date(2018, 10, 1) datetime.date(2018, 11, 1)
 datetime.date(2018, 12, 1) datetime.date(2019, 1, 1)
 datetime.date(2019, 2, 1) datetime.date(2019, 3, 1)
 datetime.date(2019, 4, 1) datetime.date(2019, 5, 1)
 datetime.date(2019, 6, 1) datetime.date(2019, 7, 1)
 datetime.date(2019, 8, 1) datetime.date(2019, 9, 1)
 datetime.date(2019, 10, 1) datetime.date(2019, 11, 1)
 datetime.date(2019, 12, 1) datetime.date(2020, 1, 1)
 datetime.date(2020, 2, 1) datetime.date(2020, 3, 1)
 datetime.date(2020, 4, 1) datetime.date(2020, 5, 1)
 datetime.date(2020, 6, 1)]

year :  [2017 2018 2019 2020]

month_name :  ['June' 'July' 'August' 'September' 'October' 'November' 'December'
 'January' 'February' 'March' 'April' 'May']

date_yy_mmm :  ['17-Jun\r' '17-Jul\r' '17-Aug\r' '17-Sep\r' '17-Oct\r' '17-Nov\r'
 '17-Dec\r' '18-Jan\r' '18-Feb\r' '18-Mar\r' '18-Apr\r' '18-May\r'
 '18-Jun\r' '18-Jul\r' '18-Aug\r' '18-Sep\r' '18-Oct\r' '18-Nov\r'
 '18-Dec\r' '19-Jan\r' '19-Feb\r' '19-Mar\r' '19-Apr\r' '19-May\r'
 '19-Jun\r' '19-Jul\r' '19-Aug\r' '19-Sep\r' '19-Oct\r' '19-Nov\r'
 '19-Dec\r' '20-Jan\r' '20-Feb\r' '20-Mar\r' '20-Apr\r' '20-May\r'
 '20-Jun\r']

In [77]:
# update
command72 = '''
    UPDATE date
    SET date_yy_mmm = REPLACE(date_yy_mmm, '\r', '')
    WHERE date_yy_mmm LIKE '%\r' 
    ;
'''

update(command72)

'successfully updated'

In [78]:
# clean date table
command73 = '''
    SELECT * FROM sales.date;
'''

date_clean = select(command73)
date_clean.head()

         date     cy_date  year month_name date_yy_mmm
0  2017-06-01  2017-06-01  2017       June      17-Jun
1  2017-06-02  2017-06-01  2017       June      17-Jun
2  2017-06-03  2017-06-01  2017       June      17-Jun
3  2017-06-04  2017-06-01  2017       June      17-Jun
4  2017-06-05  2017-06-01  2017       June      17-Jun

In [79]:
# Export data to csv
date_clean.to_csv(r'csv_file/date_clean.csv', 
                index = False, 
                header=True)

## Want to know transaction in 2020

In [42]:
# Transactions Table
command8 = '''
    SELECT tr.order_date, tr.sales_amount, dt.year
    FROM sales.transactions as tr
    INNER JOIN sales.date as dt
    ON tr.order_date = dt.date
    WHERE dt.year = 2020
    ;
'''

transactions_2020 = select(command8)
transactions_2020.head()

   order_date  sales_amount  year
0  2020-01-09         630.0  2020
1  2020-01-10         472.0  2020
2  2020-01-17        2042.0  2020
3  2020-02-07         417.0  2020
4  2020-02-14         310.0  2020

In [43]:
# we want to know total_sales_amount 2020
command9 = '''
    SELECT sum(tr.sales_amount) AS total_sales_amount
    FROM sales.transactions as tr
    INNER JOIN sales.date as dt
    ON tr.order_date = dt.date
    WHERE dt.year = 2020
    ;
'''

select(command9)

   total_sales_amount
0         142235559.0

## Want to know transaction in 2019

In [44]:
# we want to know total_sales_amount 2019
command10 = '''
    SELECT sum(tr.sales_amount) AS total_sales_amount
    FROM sales.transactions as tr
    INNER JOIN sales.date as dt
    ON tr.order_date = dt.date
    WHERE dt.year = 2019
    ;
'''

select(command10)

   total_sales_amount
0         336452114.0

## Want to know transactions and product from Chennai

Chennai have market_code = 'Mark001'

In [49]:
# Chennai Transaction
command11 = '''
    SELECT tr.*, dt.*
    FROM sales.transactions as tr
    INNER JOIN sales.date as dt
    ON tr.order_date = dt.date
    WHERE 
        dt.year = 2020
        AND
        tr.market_code = 'Mark001'
    ;
'''

select(command11).head()

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency,date,cy_date,year,month_name,date_yy_mmm
0,Prod040,Cus001,Mark001,2020-01-17,40,25116.0,INR\r,2020-01-17,2020-01-01,2020,January,20-Jan\r
1,Prod040,Cus001,Mark001,2020-01-21,80,56083.0,INR\r,2020-01-21,2020-01-01,2020,January,20-Jan\r
2,Prod040,Cus001,Mark001,2020-01-28,40,25116.0,INR\r,2020-01-28,2020-01-01,2020,January,20-Jan\r
3,Prod040,Cus001,Mark001,2020-02-13,40,25116.0,INR\r,2020-02-13,2020-02-01,2020,February,20-Feb\r
4,Prod040,Cus001,Mark001,2020-04-15,40,28042.0,INR\r,2020-04-15,2020-04-01,2020,April,20-Apr\r

In [52]:
# Product Buying from Chennai 
command12 = '''
    SELECT tr.*, prod.*
    FROM sales.transactions as tr
    INNER JOIN sales.products as prod
    ON tr.product_code = prod.product_code
    WHERE 
        tr.market_code = 'Mark001'
    ;
'''

select(command12).head()

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency,product_code,product_type
0,Prod001,Cus001,Mark001,2017-10-10,100,41241.0,INR,Prod001,Own Brand\r
1,Prod013,Cus001,Mark001,2017-10-10,240,143560.0,INR,Prod013,Own Brand\r
2,Prod001,Cus001,Mark001,2017-10-10,100,41241.0,INR\r,Prod001,Own Brand\r
3,Prod013,Cus001,Mark001,2017-10-10,240,143560.0,INR\r,Prod013,Own Brand\r
4,Prod016,Cus001,Mark001,2018-06-28,187,115481.0,INR\r,Prod016,Own Brand\r

In [11]:
# conn.commit used to confirm any changes you make
connection.commit()

# conn.close used to close the connection you make
connection.close()